###############################################################
#  Generated by:      Cadence Innovus 25.13-s088_1
#  OS:                Linux x86_64(Host ID ecomp)
#  Generated on:      Wed May 27 16:08:06 2026
#  Design:            multiplier32FP
#  Command:           write_db /home/ufsm00291/ufsm00291-lima202020189/projetos/multiplier32FP/multiplier32FP/backend/layout/deliverables/multiplier32FP_worst_371_0/final.enc
###############################################################
current_design multiplier32FP
set_units -time 1ns -capacitance 1pf
create_clock [get_ports {clk}]  -name clk -period 2.695000 -waveform {0.000000 1.347500}
set_propagated_clock  [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
#END OF CLOCK SECTION#
set_input_transition -min -rise 0.146  [get_ports {rst_n}]
set_input_transition -min -fall 0.164  [get_ports {rst_n}]
set_input_transition -max -rise 0.264  [get_ports {rst_n}]
set_input_transition -max -fall 0.252  [get_ports {rst_n}]
set_input_transition -min -rise 0.146  [get_ports {a_i[31]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[31]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[31]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[31]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[30]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[30]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[30]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[30]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[29]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[29]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[29]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[29]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[28]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[28]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[28]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[28]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[27]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[27]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[27]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[27]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[26]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[26]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[26]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[26]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[25]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[25]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[25]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[25]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[24]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[24]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[24]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[24]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[23]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[23]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[23]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[23]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[22]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[22]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[22]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[22]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[21]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[21]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[21]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[21]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[20]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[20]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[20]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[20]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[19]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[19]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[19]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[19]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[18]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[18]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[18]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[18]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[17]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[17]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[17]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[17]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[16]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[16]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[16]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[16]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[15]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[15]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[15]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[15]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[14]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[14]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[14]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[14]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[13]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[13]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[13]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[13]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[12]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[12]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[12]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[12]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[11]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[11]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[11]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[11]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[10]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[10]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[10]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[10]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[9]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[9]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[9]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[9]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[8]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[8]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[8]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[8]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[7]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[7]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[7]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[7]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[6]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[6]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[6]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[6]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[5]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[5]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[5]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[5]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[4]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[4]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[4]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[4]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[3]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[3]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[3]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[3]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[2]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[2]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[2]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[2]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[1]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[1]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[1]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[1]}]
set_input_transition -min -rise 0.146  [get_ports {a_i[0]}]
set_input_transition -min -fall 0.164  [get_ports {a_i[0]}]
set_input_transition -max -rise 0.264  [get_ports {a_i[0]}]
set_input_transition -max -fall 0.252  [get_ports {a_i[0]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[31]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[31]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[31]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[31]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[30]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[30]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[30]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[30]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[29]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[29]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[29]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[29]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[28]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[28]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[28]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[28]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[27]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[27]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[27]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[27]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[26]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[26]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[26]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[26]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[25]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[25]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[25]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[25]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[24]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[24]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[24]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[24]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[23]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[23]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[23]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[23]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[22]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[22]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[22]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[22]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[21]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[21]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[21]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[21]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[20]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[20]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[20]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[20]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[19]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[19]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[19]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[19]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[18]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[18]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[18]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[18]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[17]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[17]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[17]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[17]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[16]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[16]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[16]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[16]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[15]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[15]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[15]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[15]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[14]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[14]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[14]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[14]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[13]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[13]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[13]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[13]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[12]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[12]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[12]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[12]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[11]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[11]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[11]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[11]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[10]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[10]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[10]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[10]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[9]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[9]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[9]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[9]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[8]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[8]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[8]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[8]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[7]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[7]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[7]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[7]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[6]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[6]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[6]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[6]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[5]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[5]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[5]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[5]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[4]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[4]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[4]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[4]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[3]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[3]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[3]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[3]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[2]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[2]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[2]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[2]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[1]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[1]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[1]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[1]}]
set_input_transition -min -rise 0.146  [get_ports {b_i[0]}]
set_input_transition -min -fall 0.164  [get_ports {b_i[0]}]
set_input_transition -max -rise 0.264  [get_ports {b_i[0]}]
set_input_transition -max -fall 0.252  [get_ports {b_i[0]}]
set_input_transition -min -rise 0.146  [get_ports {start_i}]
set_input_transition -min -fall 0.164  [get_ports {start_i}]
set_input_transition -max -rise 0.264  [get_ports {start_i}]
set_input_transition -max -fall 0.252  [get_ports {start_i}]
set_load -pin_load -max  0.045  [get_ports {product_o[31]}]
set_load -pin_load -min  0.045  [get_ports {product_o[31]}]
set_load -pin_load -max  0.045  [get_ports {product_o[30]}]
set_load -pin_load -min  0.045  [get_ports {product_o[30]}]
set_load -pin_load -max  0.045  [get_ports {product_o[29]}]
set_load -pin_load -min  0.045  [get_ports {product_o[29]}]
set_load -pin_load -max  0.045  [get_ports {product_o[28]}]
set_load -pin_load -min  0.045  [get_ports {product_o[28]}]
set_load -pin_load -max  0.045  [get_ports {product_o[27]}]
set_load -pin_load -min  0.045  [get_ports {product_o[27]}]
set_load -pin_load -max  0.045  [get_ports {product_o[26]}]
set_load -pin_load -min  0.045  [get_ports {product_o[26]}]
set_load -pin_load -max  0.045  [get_ports {product_o[25]}]
set_load -pin_load -min  0.045  [get_ports {product_o[25]}]
set_load -pin_load -max  0.045  [get_ports {product_o[24]}]
set_load -pin_load -min  0.045  [get_ports {product_o[24]}]
set_load -pin_load -max  0.045  [get_ports {product_o[23]}]
set_load -pin_load -min  0.045  [get_ports {product_o[23]}]
set_load -pin_load -max  0.045  [get_ports {product_o[22]}]
set_load -pin_load -min  0.045  [get_ports {product_o[22]}]
set_load -pin_load -max  0.045  [get_ports {product_o[21]}]
set_load -pin_load -min  0.045  [get_ports {product_o[21]}]
set_load -pin_load -max  0.045  [get_ports {product_o[20]}]
set_load -pin_load -min  0.045  [get_ports {product_o[20]}]
set_load -pin_load -max  0.045  [get_ports {product_o[19]}]
set_load -pin_load -min  0.045  [get_ports {product_o[19]}]
set_load -pin_load -max  0.045  [get_ports {product_o[18]}]
set_load -pin_load -min  0.045  [get_ports {product_o[18]}]
set_load -pin_load -max  0.045  [get_ports {product_o[17]}]
set_load -pin_load -min  0.045  [get_ports {product_o[17]}]
set_load -pin_load -max  0.045  [get_ports {product_o[16]}]
set_load -pin_load -min  0.045  [get_ports {product_o[16]}]
set_load -pin_load -max  0.045  [get_ports {product_o[15]}]
set_load -pin_load -min  0.045  [get_ports {product_o[15]}]
set_load -pin_load -max  0.045  [get_ports {product_o[14]}]
set_load -pin_load -min  0.045  [get_ports {product_o[14]}]
set_load -pin_load -max  0.045  [get_ports {product_o[13]}]
set_load -pin_load -min  0.045  [get_ports {product_o[13]}]
set_load -pin_load -max  0.045  [get_ports {product_o[12]}]
set_load -pin_load -min  0.045  [get_ports {product_o[12]}]
set_load -pin_load -max  0.045  [get_ports {product_o[11]}]
set_load -pin_load -min  0.045  [get_ports {product_o[11]}]
set_load -pin_load -max  0.045  [get_ports {product_o[10]}]
set_load -pin_load -min  0.045  [get_ports {product_o[10]}]
set_load -pin_load -max  0.045  [get_ports {product_o[9]}]
set_load -pin_load -min  0.045  [get_ports {product_o[9]}]
set_load -pin_load -max  0.045  [get_ports {product_o[8]}]
set_load -pin_load -min  0.045  [get_ports {product_o[8]}]
set_load -pin_load -max  0.045  [get_ports {product_o[7]}]
set_load -pin_load -min  0.045  [get_ports {product_o[7]}]
set_load -pin_load -max  0.045  [get_ports {product_o[6]}]
set_load -pin_load -min  0.045  [get_ports {product_o[6]}]
set_load -pin_load -max  0.045  [get_ports {product_o[5]}]
set_load -pin_load -min  0.045  [get_ports {product_o[5]}]
set_load -pin_load -max  0.045  [get_ports {product_o[4]}]
set_load -pin_load -min  0.045  [get_ports {product_o[4]}]
set_load -pin_load -max  0.045  [get_ports {product_o[3]}]
set_load -pin_load -min  0.045  [get_ports {product_o[3]}]
set_load -pin_load -max  0.045  [get_ports {product_o[2]}]
set_load -pin_load -min  0.045  [get_ports {product_o[2]}]
set_load -pin_load -max  0.045  [get_ports {product_o[1]}]
set_load -pin_load -min  0.045  [get_ports {product_o[1]}]
set_load -pin_load -max  0.045  [get_ports {product_o[0]}]
set_load -pin_load -min  0.045  [get_ports {product_o[0]}]
set_load -pin_load -max  0.045  [get_ports {done_o}]
set_load -pin_load -min  0.045  [get_ports {done_o}]
set_load -pin_load -max  0.045  [get_ports {nan_o}]
set_load -pin_load -min  0.045  [get_ports {nan_o}]
set_load -pin_load -max  0.045  [get_ports {infinit_o}]
set_load -pin_load -min  0.045  [get_ports {infinit_o}]
set_load -pin_load -max  0.045  [get_ports {overflow_o}]
set_load -pin_load -min  0.045  [get_ports {overflow_o}]
set_load -pin_load -max  0.045  [get_ports {underflow_o}]
set_load -pin_load -min  0.045  [get_ports {underflow_o}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[12]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[6]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[7]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[31]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[21]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[14]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[24]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[17]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {start_i}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[2]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[3]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[29]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[26]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[19]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[10]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[20]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[13]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[7]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[8]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[22]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[15]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[25]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[18]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[3]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[4]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {rst_n}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[27]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[11]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[21]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[14]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[8]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[9]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[0]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[30]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[23]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[16]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[26]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[19]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[10]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[4]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[5]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[28]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[12]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[22]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[15]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[9]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[0]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[1]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[31]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[24]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[17]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[27]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[11]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[5]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[6]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[29]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[20]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[13]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[30]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[23]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[16]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[1]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[2]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {b_i[28]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[25]}]
set_input_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {a_i[18]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[31]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[24]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[17]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[7]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[22]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[15]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[5]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {done_o}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {infinit_o}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[20]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[13]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[3]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {underflow_o}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[11]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[1]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[29]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[27]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {overflow_o}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[25]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[18]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[8]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[30]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[23]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[16]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[6]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[21]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[14]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[4]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[12]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[2]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[10]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[0]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {nan_o}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[28]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[26]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[19]}]
set_output_delay -add_delay 0.3 -clock [get_clocks {clk}] [get_ports {product_o[9]}]
set_clock_uncertainty 0.05 [get_clocks {clk}]
set_ideal_network -no_propagate  [get_ports {rst_n}]
